Tekla Open API Reference for Tekla Structures 2025
Distance.FromFractionalFeetAndInchesString Method (String)
 Creates a distance from a string representation of fractional feet and inches.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance FromFractionalFeetAndInchesString(
	string text
)
Public Shared Function FromFractionalFeetAndInchesString (
	text As String
) As Distance
Parameters
text
Type: System.String
The distance string.
Return Value
Type: Distance
The representation of the specified distance.
Exceptions
Exception | Condition
FormatException | Thrown if the text does not represent a distance.
Examples
 This example shows how to parse a Distance instance from a fractional string representation of feet and inches.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance distance = Distance.FromFractionalFeetAndInchesString("3' 3/4");
       }
}
See Also
Reference
Distance Structure
FromFractionalFeetAndInchesString Overload
Tekla.Structures.Datatype Namespace